# 從 Paino 模組引入所有函式和類別
from Paino import *

# 定義蜂鳴器所連接的腳位
buzzerPIN = 7  # 蜂鳴器連接到 GPIO 7

# 建立一個 Paino 物件，並將蜂鳴器腳位作為參數傳入
music = Paino(buzzerPIN)  # 使用 7 號腳位初始化 Paino 物件

# 定義音階的頻率
do5 = 523  # C 音的頻率
dod5 = 554  # C# 音的頻率
re5 = 587  # D 音的頻率
red5 = 622  # D# 音的頻率
mi5 = 659  # E 音的頻率
fa5 = 698  # F 音的頻率
fad5 = 739  # F# 音的頻率
sol5 = 784  # G 音的頻率
sold5 = 830  # G# 音的頻率
la5 = 880  # A 音的頻率
lad5 = 932  # A# 音的頻率
si5 = 987  # B 音的頻率

# 定義一個列表，其中包含要演奏的音符、持續時間和間隔
songlist = [
    [mi5, 0.1, 0.1], [red5, 0.1, 0.1], [mi5, 0.1, 0.1], 
    [red5, 0.1, 0.1], [mi5, 0.1, 0.1], [si5, 0.1, 0.1], 
    [re5, 0.1, 0.1], [do5, 0.1, 0.1], [la5, 0.5, 0.1], 
    [do5, 0.1, 0.1], [mi5, 0.1, 0.1], [la5, 0.1, 0.1], 
    [si5, 0.5, 0.1], [mi5, 0.1, 0.1], [sold5, 0.1, 0.1], 
    [si5, 0.1, 0.1], [do5, 0.5, 0.1], [mi5, 0.1, 0.1], 
    [red5, 0.1, 0.1], [mi5, 0.1, 0.1], [red5, 0.1, 0.1], 
    [mi5, 0.1, 0.1], [si5, 0.1, 0.1], [re5, 0.1, 0.1], 
    [do5, 0.1, 0.1], [la5, 0.5, 0.1], [do5, 0.1, 0.1], 
    [mi5, 0.1, 0.1], [la5, 0.1, 0.1], [si5, 0.5, 0.1], 
    [mi5, 0.1, 0.1], [do5, 0.1, 0.1], [si5, 0.1, 0.1], 
    [la5, 0.5, 0.1], [si5, 0.1, 0.1], [do5, 0.1, 0.1], 
    [re5, 0.1, 0.1], [mi5, 0.5, 0.1], [sol5, 0.1, 0.1], 
    [fa5, 0.1, 0.1], [mi5, 0.1, 0.1], [re5, 0.5, 0.1], 
    [fa5, 0.1, 0.1], [mi5, 0.1, 0.1], [re5, 0.1, 0.1], 
    [do5, 0.5, 0.1], [mi5, 0.1, 0.1], [re5, 0.1, 0.1], 
    [do5, 0.1, 0.1], [si5, 0.5, 0.1], [mi5, 0.1, 0.1], 
    [red5, 0.1, 0.1], [mi5, 0.1, 0.1], [red5, 0.1, 0.1], 
    [mi5, 0.1, 0.1], [si5, 0.1, 0.1], [re5, 0.1, 0.1], 
    [do5, 0.1, 0.1], [la5, 0.5, 0.1], [do5, 0.1, 0.1], 
    [mi5, 0.1, 0.1], [la5, 0.1, 0.1], [si5, 0.5, 0.1], 
    [mi5, 0.1, 0.1], [do5, 0.1, 0.1], [si5, 0.1, 0.1], 
    [la5, 0.5, 0.1]
]

# 使用 playsong 函式播放音符列表
music.playsong(songlist)  # 使用定義的 songlist 播放歌曲
